app/Controllers/Monitoring.php

    public function index()
    {
        helper('date');

        // Ambil data ruangan hari ini
        $model = new RoomUsageModel();
        $today = date('Y-m-d');
        $data['usages'] = $model->select('room_usages.*, rooms.room_name AS room')
                            ->join('rooms', 'rooms.id = room_usages.room_name')
                            ->where('date', $today)
                            ->orderBy('start_time', 'ASC')
                            ->findAll();
---
SELECT `room_usages`.*, `rooms`.`room_name` AS `room`
FROM `room_usages`
JOIN `rooms` ON `rooms`.`id` = `room_usages`.`room_name`
WHERE `date` = '2025-06-24'
ORDER BY `start_time` ASC